type/app/views/bulletin_boards/show.html.erb

SELECT "typeios".* FROM "typeios"
---
      <div class="typeio-body"><p>body: <%= typeio.body %></p></div>
      <div class="typeio-likes"><p>likes: <%= typeio.get_likes.size - typeio.get_dislikes.size %></p></div>