type/app/controllers/bulletin_boards_controller.rb

  def index
    @bulletin_boards = BulletinBoard.all
---
SELECT "bulletin_boards".* FROM "bulletin_boards"

    def set_bulletin_board
          @bulletin_board = BulletinBoard.find(params[:id])
---
SELECT  "bulletin_boards".* FROM "bulletin_boards" WHERE "bulletin_boards"."id" = ? LIMIT 1  [["id", 46]]