type/app/controllers/groups_controller.rb

  def index
    @groups = current_user.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ?  [["user_id", 28]]

  def create
    @group = Group.new(group_params)
    b = BulletinBoard.create
    @group.bulletin_board = b
    @user = current_user
    @user.groups << @group
---
INSERT INTO "bulletin_boards" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-11-13 19:21:43.057862"], ["updated_at", "2016-11-13 19:21:43.057862"]]
INSERT INTO "groups" ("name", "created_by", "bulletin_board_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "werkjhwer"], ["created_by", "lwkejrwer"], ["bulletin_board_id", 29], ["created_at", "2016-11-13 19:24:47.023726"], ["updated_at", "2016-11-13 19:24:47.023726"]]

    def set_group
      @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]