type/app/controllers/registrations_controller.rb

    def create
        super
				b = BulletinBoard.create
---
INSERT INTO "bulletin_boards" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-11-13 05:40:08.248176"], ["updated_at", "2016-11-13 05:40:08.248176"]]