type/app/controllers/typeios_controller.rb

INSERT INTO "typeios" ("username", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "hello"], ["body", "world"], ["created_at", "2016-11-07 03:03:04.653120"], ["updated_at", "2016-11-07 03:03:04.653120"]]
---
  def create
      @typeio = Typeio.new(typeio_params)
      @typeio.bulletin_board = @bulletin_board
      @typeio.user = current_user

    respond_to do |format|
      if @typeio.save

SELECT  "typeios".* FROM "typeios" WHERE "typeios"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_typeio
      @typeio = Typeio.find(params[:id])

SELECT  "bulletin_boards".* FROM "bulletin_boards" WHERE "bulletin_boards"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_bulletin_board
      @bulletin_board = BulletinBoard.find(params[:bulletin_board_id])